<?php

/**
 * task4.1
 * Создать массив целых чисел. Написать функцию поиска самого большого числа.
 * Создать массив строк. Написать функцию поиска самой длинной строки по переданному массиву.
 */
/**
 * task4.2
 * 
 * Создать массив строк. Написать функцию, которая работает с одной строкой, считает встретившиеся там буквы.
 * 
 */
/**
 * task4.3
 * 
 * Попробовать реализовать fizzbuzz задачу с чтением из файла результата, но без циклов, заменяя циклы на 
 * функцию array_map. Для этого придется изучить вопросы замыканий в php...
 * 
 */